---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.SketchId
source: html/54174aa5-f45a-c7f5-5b65-5a3a9ea3af95.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.SketchId Property

The id of the Sketch element for this element.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```